
from utils import *
Machine_types = (
("منشار","منشار"),
('فارة','فارة'),
('رابون','رابون'),
('منقار','منقار'),
('صنية','صنية'),
('ملكانة','ملكانة'),
('مجموعة','مجموعة'),
('حلية','حلية'),
('دسك','دسك'),
('مكنة نشارة','مكنة نشارة'),
('عجل سحاب','عجل سحاب'),
('ماتور','ماتور'),
('مكنة لحام صفايح','مكنة لحام صفايح'),
('مكنة سن صفايح','مكنة سن صفايح'),
('مكنة شطف كساتير','مكنة شطف كساتير'),
('يد مكنسة','يد مكنسة'),
)

Locations = (
("فهمي","فهمي"),
('ياسر','ياسر'),
('ابو سكر','ابو سكر'),
('بجوار ابو سكر','بجوار ابو سكر'),
('ام سماح','ام سماح'),
('الشيخ','الشيخ'),
('محل المنزل','محل المنزل'),
('بجوار الورشه','بجوار الورشه'),
('عصمت','عصمت'),
('رزق','رزق'),
('ياسر٢','ياسر٢'),
('ماتور','ماتور'),
('بجوار الشقة','بجوار الشقة'),
('ناصر المصدي','ناصر المصدي'),
('امام عوض','امام عوض'),
('محل ورده','محل ورده'),
('ابو اسلام','ابو اسلام'),
('محمد شوقي','محمد شوقي'),
('المساكن','المساكن'),
)

Marks = (
('بلدي',"بلدي"),
('ايطالي','ايطالي'),
('انجليزي','انجليزي'),
('بولندي','بولندي'),
('بولغاري','بولغاري'),
)

Owners = (
("ماما","ماما"),
('يسرا','يسرا'),
('عبدالله','عبدالله'),
('عبدالهادي','عبدالهادي'),
('محمد','محمد'),
)
Operations = (('سحب','سحب'),('ايداع','ايداع'))
percent_dict = compute_percent_dict(Owners)